src/DataProcessors/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/РасчетыСПокупателями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПокупателями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма в регламентированной валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегИнт</Name>
					<Comment>Сумма в регламентированной валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗачета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаИРаспределенияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаСертификатом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОплатаЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаВА</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма в регламентированной валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегИнт</Name>
					<Comment>Сумма в регламентированной валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнымКартам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗачета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаИРаспределенияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОплатаЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Долг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ЗакрытиеМесяца/Forms/СписокКонтрагентов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Контрагенты") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Параметры.Свойство("Режим", Режим);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Месяц", Месяц);
	ОшибкиНаНачало = Ложь;
	Для каждого СтруктураОписания Из Параметры.Контрагенты Цикл
		НоваяСтрока = СписокКонтрагентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураОписания);
		НоваяСтрока.ОсталосьЗачесть = НоваяСтрока.КЗачету;
		НоваяСтрока.Пометка = Истина;
		ОшибкиНаНачало = ОшибкиНаНачало ИЛИ НоваяСтрока.ОшибкиНаНачало;
	КонецЦикла;
	
	// Автоматический зачет возможен только при включении опции "Автозачет авансов" в настройках программы
	БезАвтоматическогоЗачета = (ПолучитьФункциональнуюОпцию("ЗачитыватьАвансыДолгиАвтоматически") <> Перечисления.ДаНет.Да);
	Если БезАвтоматическогоЗачета Тогда
		Элементы.ФормаЗачестьВыделенные.Видимость = Ложь;
		Элементы.ФормаОткрытьОтчет.КнопкаПоУмолчанию = Истина;
		Элементы.СписокКонтрагентовЗачтеноАвтоматически.Видимость = Ложь;
	КонецЕсли; 
	
	Если ОшибкиНаНачало Тогда
		Если БезАвтоматическогоЗачета Тогда
			Шаблон = НСтр("ru = 'У некоторых %1 есть незачтенные авансы на начало %2 %3 г. Следует выполнить анализ и зачет авансов более ранних периодов.'");;
		Иначе
			Шаблон = НСтр("ru = 'У некоторых %1 есть незачтенные авансы на начало %2 %3 г. Автоматический зачет выполняется только для документов этого месяца.
		                  |Следует выполнить анализ и зачет авансов более ранних периодов.'");;
		КонецЕсли; 
		Если Режим = "Покупатели" Тогда
			Заголовок = НСтр("ru = 'Список покупателей'");
			Элементы.СписокКонтрагентовКонтрагент.Заголовок = НСтр("ru = 'Покупатель'");
			СтрокаКонтрагенты = НСтр("ru = 'покупателей'");	
		ИначеЕсли Режим = "Поставщики" Тогда
			Заголовок = НСтр("ru = 'Список поставщиков'");
			Элементы.СписокКонтрагентовКонтрагент.Заголовок = НСтр("ru = 'Поставщик'");
			СтрокаКонтрагенты = НСтр("ru = 'поставщиков'");
		Иначе
			СтрокаКонтрагенты = НСтр("ru = 'контрагентов'");
		КонецЕсли;
		ИмяМесяца = ЗакрытиеМесяца.ИмяМесяцаВПадеже(Месяц(Месяц), "Р");
		ГодСтрокой = Формат(Год(Месяц), "ЧГ=0");
		Элементы.ДекорацияОшибкиНаНачало.Заголовок = СтрШаблон(Шаблон, СтрокаКонтрагенты, ИмяМесяца, ГодСтрокой);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКонтрагентов

&НаКлиенте
Процедура СписокКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПодробныйОтчет();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗачестьВыделенные(Команда)
	
	ЗачестьВыделенныеСервер();
	Если СписокКонтрагентов.Количество() = 0 Тогда
		Закрыть(Истина);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для каждого СтрокаТаблицы Из СписокКонтрагентов Цикл
		СтрокаТаблицы.Пометка = Истина;
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого СтрокаТаблицы Из СписокКонтрагентов Цикл
		СтрокаТаблицы.Пометка = Ложь;
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	ПодробныйОтчет();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗачестьВыделенныеСервер()
	
	Для каждого СтрокаТаблицы Из СписокКонтрагентов Цикл
		
		Если НЕ СтрокаТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Режим = "Покупатели" Тогда
			ПерезаполнитьДокументыПокупателя(СтрокаТаблицы);
		ИначеЕсли Режим = "Поставщики" Тогда
			ПерезаполнитьДокументыПоставщика(СтрокаТаблицы);
		КонецЕсли; 
			
	КонецЦикла;
	
	ОбновитьДанные();
	
КонецПроцедуры

// В процедуре выполняется заполнение табличных частей "Предоплата" и "РасшифровкаПлатежа"
// а также проведение документов, т.е. производит программный зачет авансов по разделу "Расчеты с покупателями"
//
&НаСервере
Процедура ПерезаполнитьДокументыПокупателя(СтрокаТаблицы)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасчетыСПокупателямиОбороты.Регистратор КАК Регистратор,
	|	РасчетыСПокупателямиОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И Договор = &Договор) КАК РасчетыСПокупателямиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор");
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", СтрокаТаблицы.Контрагент);
	Запрос.УстановитьПараметр("Договор", СтрокаТаблицы.Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Если ЭтоДокументОплаты(Выборка.Регистратор) Тогда
				// Перезаполнение расшифровки
				ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект(); 
				ДокументОбъект.ЗаполнитьРасшифровкуПлатежа();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ЗаписатьИсториюИзмененияОбъекта(
				Выборка.Регистратор, 
				НСтр("ru = 'Проведение'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				НСтр("ru = 'Проведение документа.'", ОбщегоНазначения.КодОсновногоЯзыка()));
			ИначеЕсли Выборка.Регистратор.Метаданные().ТабличныеЧасти.Найти("Предоплата") <> Неопределено Тогда
				// Заполнение предоплат
				ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
				ДокументОбъект.ЗаполнитьПредоплату();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ЗаписатьИсториюИзмененияОбъекта(
				Выборка.Регистратор, 
				НСтр("ru = 'Проведение'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				НСтр("ru = 'Проведение документа.'", ОбщегоНазначения.КодОсновногоЯзыка()));
			КонецЕсли;
		Исключение
			Шаблон = НСтр("ru = 'Не удалось обработать  документ %1 по контрагенту %2'");
			СтрокаОшибки = СтрШаблон(Шаблон, Строка(Выборка.Регистратор), СтрокаТаблицы.Контрагент);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрокаОшибки;
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить(); 
			Ошибки = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// В процедуре выполняется заполнение табличных частей "Предоплата" и "РасшифровкаПлатежа"
// а также проведение документов, т.е. производит программный зачет авансов по разделу "Расчеты с поставщиками"
//
&НаСервере
Процедура ПерезаполнитьДокументыПоставщика(СтрокаТаблицы)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РасчетыСПоставщикамиОбороты.Регистратор КАК Регистратор,
	|	РасчетыСПоставщикамиОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Регистратор,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И Договор = &Договор) КАК РасчетыСПоставщикамиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор");
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", СтрокаТаблицы.Контрагент);
	Запрос.УстановитьПараметр("Договор", СтрокаТаблицы.Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Если ЭтоДокументОплаты(Выборка.Регистратор) Тогда 
				// Перезаполнение расшифровки
				ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект(); 
				ДокументОбъект.ЗаполнитьРасшифровкуПлатежа();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ЗаписатьИсториюИзмененияОбъекта(
				Выборка.Регистратор, 
				НСтр("ru = 'Проведение'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				НСтр("ru = 'Проведение документа.'", ОбщегоНазначения.КодОсновногоЯзыка()));
			ИначеЕсли Выборка.Регистратор.Метаданные().ТабличныеЧасти.Найти("Предоплата") <> Неопределено Тогда
				// Заполнение предоплат
				ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
				ДокументОбъект.ЗаполнитьПредоплату();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ЗаписатьИсториюИзмененияОбъекта(
				Выборка.Регистратор, 
				НСтр("ru = 'Проведение'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				НСтр("ru = 'Проведение документа.'", ОбщегоНазначения.КодОсновногоЯзыка()));
			КонецЕсли;
		Исключение
			Шаблон = НСтр("ru = 'Не удалось обработать  документ %1 по контрагенту %2'");
			СтрокаОшибки = СтрШаблон(Шаблон, Строка(Выборка.Регистратор), СтрокаТаблицы.Контрагент);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрокаОшибки;
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить(); 
			Ошибки = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция определяет, есть ли тип переданного документа в списке МассивТиповДокументыОплаты
// Параметры:
//	ДокументСсылка - ссылка определяемого документа
//
&НаСервере
Функция ЭтоДокументОплаты(ДокументСсылка)
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	МассивТиповДокументыОплаты = Новый Массив;
	МассивТиповДокументыОплаты.Добавить(Тип("ДокументСсылка.ПоступлениеВКассу"));
	МассивТиповДокументыОплаты.Добавить(Тип("ДокументСсылка.ПоступлениеНаСчет"));
	МассивТиповДокументыОплаты.Добавить(Тип("ДокументСсылка.РасходИзКассы"));
	МассивТиповДокументыОплаты.Добавить(Тип("ДокументСсылка.РасходСоСчета"));
	Возврат МассивТиповДокументыОплаты.Найти(ТипДокумента) <> Неопределено;
	
КонецФункции

// Процедура сохраняет дату и событие изменения (запись, проведение) конкретного объекта
// информационной базы
//
&НаСервере
Процедура ЗаписатьИсториюИзмененияОбъекта(ОбъектСсылка, Событие, Комментарий)
	
	ЗаписьЖурналаРегистрации(
	СтрШаблон(НСтр("ru = 'КонтрольПравильностиУчета.%1'", ОбщегоНазначения.КодОсновногоЯзыка()), Событие), 
	УровеньЖурналаРегистрации.Информация, 
	,
	ОбъектСсылка, 
	Комментарий);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Пометка", Истина);
	ТаблицаКонтрагентыДоговора = СписокКонтрагентов.Выгрузить(СтруктураОтбора, "Контрагент, Договор");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКонтрагентыДоговора", ТаблицаКонтрагентыДоговора);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Месяц));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКонтрагентыДоговора.Контрагент КАК Контрагент,
	|	ТаблицаКонтрагентыДоговора.Договор КАК Договор
	|ПОМЕСТИТЬ ТаблицаКонтрагентыДоговора
	|ИЗ
	|	&ТаблицаКонтрагентыДоговора КАК ТаблицаКонтрагентыДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегРасчетов.Контрагент КАК Контрагент,
	|	РегРасчетов.Договор КАК Договор,
	|	СУММА(ВЫБОР
	|			КОГДА РегРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА -РегРасчетов.СуммаКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК АвансКонец,
	|	СУММА(ВЫБОР
	|			КОГДА РегРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|				ТОГДА РегРасчетов.СуммаКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгКонец
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			ДвиженияИГраницыПериода,
	|			Организация = &Организация
	|				И (Контрагент, Договор) В
	|					(ВЫБРАТЬ
	|						ТаблицаКонтрагентыДоговора.Контрагент,
	|						ТаблицаКонтрагентыДоговора.Договор
	|					ИЗ
	|						ТаблицаКонтрагентыДоговора)) КАК РегРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	РегРасчетов.Контрагент,
	|	РегРасчетов.Договор";
	Если Режим = "Поставщики" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрНакопления.РасчетыСПокупателями", "РегистрНакопления.РасчетыСПоставщиками");
	КонецЕсли;
	СтруктураОтбора = Новый Структура("Контрагент, Договор");	
	Выборка = Запрос.Выполнить().Выбрать();
	СтрокиКУдалению = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Выборка, "Контрагент, Договор");
		Строки = СписокКонтрагентов.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		СтрокаСписка = Строки[0];
		СтрокаСписка.Аванс = Выборка.АвансКонец;
		СтрокаСписка.Долг = Выборка.ДолгКонец;
		СтрокаСписка.ЗачтеноАвтоматически = СтрокаСписка.КЗачету - Мин(Выборка.АвансКонец, Выборка.ДолгКонец);
		СтрокаСписка.ОсталосьЗачесть = СтрокаСписка.КЗачету - СтрокаСписка.ЗачтеноАвтоматически;
		Если Выборка.АвансКонец = 0 ИЛИ Выборка.ДолгКонец = 0 ИЛИ СтрокаСписка.ОсталосьЗачесть = 0 Тогда
			СтрокиКУдалению.Добавить(СтрокаСписка);
		КонецЕсли; 
	КонецЦикла;
	
	Если СписокКонтрагентов.Итог("ЗачтеноАвтоматически") = 0 Тогда
		Элементы.ДекорацияОшибкиНаНачало.Заголовок = 
		НСтр("ru = 'Не удалось зачесть авансы автоматически.
              |Для ручного зачета следует воспользоваться данными детального отчета.'");
	ИначеЕсли СписокКонтрагентов.Итог("ОсталосьЗачесть") > 0 Тогда
		Элементы.ДекорацияОшибкиНаНачало.Заголовок = 
		НСтр("ru = 'Автоматический зачет авансов выполнен только частично.
              |Для ручного зачета следует воспользоваться данными детального отчета.'");
	КонецЕсли;
	
	Для каждого СтрокаСписка Из СтрокиКУдалению Цикл
		СписокКонтрагентов.Удалить(СтрокаСписка);
	КонецЦикла; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПодробныйОтчет()
	
	ТекущаяСтрока = Элементы.СписокКонтрагентов.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОтборОтчета = Новый Соответствие;
	ОтборОтчета.Вставить("НачалоПериода", НачалоМесяца(Месяц));
	ОтборОтчета.Вставить("КонецПериода", КонецМесяца(Месяц));
	ОтборОтчета.Вставить("Организация", Организация);
	ОтборОтчета.Вставить("Контрагент", ТекущаяСтрока.Контрагент);
	ОтборОтчета.Вставить("Договор", ТекущаяСтрока.Договор);
	ОткрытьФорму("Отчет.Взаиморасчеты.Форма", Новый Структура("КлючВарианта, ОтборРасшифровки", "АнализНезачтенныхАвансовКонтекст", ОтборОтчета), ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
